# **Practice 03: Data Types and Data Structures**

#### **WRITE YOUR NAME HERE**

---

**IMPORTANT**:
- Before starting the lab, save a copy to your google drive by navigating to `File > Save a copy in Drive` <br>

<br>


**Instructions**: Complete the lab below.

- <font color=red>Tasks</font> indicated in red must be completed to receive credit
- Include all code for your work
- Include markdown cells with written answers explaining your work when prompted
- **NOTE: Your completed lab must be submitted to Canvas as a .ipynb file by the end of the lab session**
---

<br>

####<font color=red>Organized</font>

**Answers should be organized in the following format for organization and readability**

<font color=red>Example task 1</font>

In [ ]:
# 1.

# This will be the code block to answer the first part of a task

1. This will be the text answer/explanation (if prompted) for the first task

<font color=red>Example task 2</font>

In [ ]:
# 2.

# This will be the code block to answer the second part of a task

2. This will be the text answer/explanation (if prompted) for the second task

<br>

Continue this format for the remaining subtasks

<br>

<br>

---

####<font color=red>Task 1</font> - Collecting data

Collect the following data from at least 4 of your neighbors
* Major
* Year in school (freshman, sophomore, etc.)
* Pets (`TRUE` or `FALSE` with no quotes)
* Name of one pet (if no pet, then use `NA` with no quotes)
* Hours slept night before


If members of your group would not like to provide certain information, that is okay! Simply enter `NA` in their entry

<font color=red>Task 1.1</font>  Create 5 vectors using `c()` for each of the variables (use variable names that are useful!)

In [ ]:
#Task 1.1

major <- c("applied_math","data_science","math", "math")
year <- c("junior", "senior","freshman", "freshman")
has_pet <- c(TRUE, TRUE, TRUE, TRUE)
name_pet <- c("Bombon", "Lily", "Princess", "Chofis")
hours <- c(7,6,8,11)

<br>

<font color=red>Task 1.2</font> Using the five vectors from Task 1.1, create a data frame and store the data frame as the variable `pets`.

In [ ]:
#Task 1.2
pets <- data.frame(major, year, has_pet, name_pet, hours)
pets

  major        year     has_pet name_pet hours
1 applied_math junior   TRUE    Bombon    7
2 data_science senior   TRUE    Lily      6
3 math         freshman TRUE    Princess  8
4 math         freshman TRUE    Chofis   11

<br>

<font color=red>Task 1.3</font> Use the `dim()` function to determine the number of observations and variables in the data frame `pets`.

In [ ]:
#Task 1.3
dim(pets)

[1] 4 5

<br>

<font color=red>Task 1.4</font> Use the `str()` function to determine which of the variables in the data frame are character data type.

In [ ]:
#Task 1.4
str(pets)

'data.frame':	4 obs. of  5 variables:
 $ major   : chr  "applied_math" "data_science" "math" "math"
 $ year    : chr  "junior" "senior" "freshman" "freshman"
 $ has_pet : logi  TRUE TRUE TRUE TRUE
 $ name_pet: chr  "Bombon" "Lily" "Princess" "Chofis"
 $ hours   : num  7 6 8 11

<br>

<font color=red>Task 1.5</font> Overwrite the names of the data frame to reflect the following:
  * `sdsu_major`
  * `school_year`
  * `pets_true_false`
  * `pet_name`
  * `sleep_hours`

In [ ]:
#Task 1.5
pets <- data.frame(sdsu_major= major , school_year= year , pets_true_false = has_pet , pet_name = name_pet , sleep_hours = hours )
pets

  sdsu_major   school_year pets_true_false pet_name sleep_hours
1 applied_math junior      TRUE            Bombon    7
2 data_science senior      TRUE            Lily      6
3 math         freshman    TRUE            Princess  8
4 math         freshman    TRUE            Chofis   11

<br>

<font color=red>Task 1.6</font> Assign the name of each student as the row names of the data frame using the `rownames()` functions. Show the results to verify this was performed correctly.

In [ ]:
#Task 1.6
name_students <- c("Jesse", "Ravier","Sebastien", "Abril")
rownames(pets) <- name_students
pets

          sdsu_major   school_year pets_true_false pet_name sleep_hours
Jesse     applied_math junior      TRUE            Bombon    7
Ravier    data_science senior      TRUE            Lily      6
Sebastien math         freshman    TRUE            Princess  8
Abril     math         freshman    TRUE            Chofis   11

<br>

<br>

<br>

---

####<font color=red>Task 2</font> - Manipulating data types and coercion

<font color=red>Task 2.1</font>

1. Choose a number and assign it to a variable.
2. Check the data type of your variable using the `class()` function.
3. Convert the variable to a character using the `as.character()` function and reassign to the same variable.
4. Again, check the data type of your variable using the `class()` function.
5. In a text cell, write what you observe in complete sentences.

<br>

In [ ]:
#Task 2.1 1&2
a <- 89
class(a)

#Task 2.1 3&4
str <- as.character(a)
class(str)

[1] "numeric"

[1] "character"

*Obseravtion Task 2.1 *<br>
When we us the function as.character() to change the data type of a variable. in this case we converted from numeric to character.

<font color=red>Task 2.2</font>
1. Convert the number `1` into a logical data type using the `as.logical()` function. What are your observations?
2. Convert the number `-33.8` into a logical data type using the `as.logical()` function. What are your observations?
3. Convert the number `0` into a logical data type using the `as.logical()` function. What are your observations?
4. Convert the number `2.7` into an integer data type using the `as.integer()` function. What are your observations? Is this what you expected?

In [ ]:
#Task 2.2 1
as.logical(1)

#Task 2.2 2
as.logical(-33.8)

#Task 2.2 3
as.logical(0)

#Task 2.2 4
as.logical(2.7)

Observation task 2.2

1.It has returned TRUE.<br>
2.It has returned TRUE. <br>
3.It has returned FALSE. <br>
4.It has returned TRUE.<br>
From all of this we can conclude that R considers 0 means FALSE and any other numeric type diffrent from 0 is TRUE.

<br>

<font color=red>Task 2.3</font>
1. Convert the character `"5.3"` into a `numeric` data type using the `as.numeric()` function. What are your observations?
2. Convert the character `"5.3"` into a `logical` data type using the `as.logical()` function. What are your observations?
3. Convert the character `"TRUE"` into a `logical` data type using the `as.logical()` function. What are your observations?
3. Convert the character `"5.3"` into an `integer` data type using the `as.integer()` function. What are your observations?
4. Create a character string of text of your favorite place to eat and attempt to convert the character into a `numeric` data type. What are your observations?

In [ ]:
#Task 2.3 1
 as.numeric("5.3")

#Task 2.3 2
as.logical("5.3")

#Task 2.3 3
as.logical("TRUE")

#Task 2.3 4
as.integer("5.3")

#Task 2.3 5
 as.numeric("DARCY")

[1] 5.3

[1] NA

[1] TRUE

[1] 5

Warning message:
“NAs introduced by coercion”

[1] NA

Observation task 2.3

1.The conversion has worked from character type to numeric type, returning 5.3 as numeric<br>
2.The conversion from character type to logival type returned NA <br>
3.The conversion has worked from character type to logical type, returning TRUE<br>
4.The conversion has worked from character type to integer type, returning 5, when the input was 5.3, it has done a conversion and an aproximation.<br>
5.The conversion from character type to numerci didn't work, it even gave us a waring message. This means we can't use strings made of letters to obtain a numeric type

<br>

<font color=red>Task 2.4</font>
1. Convert the logical `TRUE` into a `numeric` data type using the `as.numeric()` function.  What are your observations?
2. Convert the logical `FALSE` into a `numeric` data type using the `as.numeric()` function.  What are your observations?
3. Convert the logical `TRUE` into a `character` data type using the `as.character()` function.  What are your observations?
4. Convert the logical `FALSE` into an `integer` data type using the `as.integer()` function.  What are your observations?

In [ ]:
#Task 2.4 1
as.numeric(TRUE)

#Task 2.4 2
as.numeric(FALSE)

#Task 2.4 3
as.character(TRUE)

#Task 2.4 4
as.integer(FALSE)

[1] 1

[1] 0

[1] "TRUE"

[1] 0

Observation task 2.4

1.If we convert a logical type to numeric we get 1, when the logic type is True <br>
2.If we convert a logical type to numeric we get 0, when the logic type is False<br>
3.If we convert a logical type to character we get how that logic type is spelled <br>
4.If we convert a logical type to integer we get 1/0, (just like in numerc)
<br>

<font color=red>Task 2.5</font>
1. Add a `character` data type to a `numeric` data type. What are your observations?
2. Add a `TRUE` logical to a `numeric` data type. What are you observations?
3. Add a `character` data type to a `logical` data type. What are your observations?

In [ ]:
#Task 2.5 1
"2" + 5

ERROR: Error in "2" + 5: non-numeric argument to binary operator

In [ ]:
#Task 2.5 2
TRUE + 5

In [ ]:
#Task 2.5 3
"2"+ TRUE

Observation task 2.5

1.we get an error when we try to add up a character type and a numeric type. The error points out that we use a non numeric type (reffering to the character type) <br>
2.we can add up a numeric and logical type, because logical types have a numeric representation 0/1.<br>
3.we get an error when we try to add up a character type and a logical type. The error points out that we use a non numeric type (reffering to the character type), the logical type has a numeric representation so it's not it causing the error, as seen in 2.<br>

<br>

<br>

<br>

<br>